#ifndef TZIAKCHA_MAHJONG_CONSTANTS_H
#define TZIAKCHA_MAHJONG_CONSTANTS_H

#include <array>
#include <map>
#include <string>
#include <vector>

namespace tziakcha {
namespace base {

inline const std::array<std::string, 4> WIND = {"东", "南", "西", "北"};

inline const std::array<std::string, 34> TILE_IDENTITY = {
    "1m", "2m", "3m", "4m", "5m", "6m", "7m", "8m", "9m", "1s", "2s", "3s",
    "4s", "5s", "6s", "7s", "8s", "9s", "1p", "2p", "3p", "4p", "5p", "6p",
    "7p", "8p", "9p", "E",  "S",  "W",  "N",  "C",  "F",  "B"};

inline const std::array<std::string, 8> FLOWER_TILES = {
    "1f", "2f", "3f", "4f", "5f", "6f", "7f", "8f"};

inline const std::map<int, std::string> PACK_ACTION_MAP = {
    {3, "CHI"}, {4, "PENG"}, {5, "GANG"}};

inline const std::array<std::array<int, 4>, 16> S2O = {{
    {{0, 1, 2, 3}},
    {{1, 2, 3, 0}},
    {{2, 3, 0, 1}},
    {{3, 0, 1, 2}},
    {{1, 0, 3, 2}},
    {{0, 3, 2, 1}},
    {{3, 2, 1, 0}},
    {{2, 1, 0, 3}},
    {{2, 3, 1, 0}},
    {{3, 1, 0, 2}},
    {{1, 0, 2, 3}},
    {{0, 2, 3, 1}},
    {{3, 2, 0, 1}},
    {{2, 0, 1, 3}},
    {{0, 1, 3, 2}},
    {{1, 3, 2, 0}},
}};

inline const std::array<std::string, 89> FAN_NAMES = {
    "无",          "大四喜",      "大三元",       "绿一色",      "九莲宝灯",
    "四杠",        "连七对",      "十三幺",       "清幺九",      "小四喜",
    "小三元",      "字一色",      "四暗刻",       "一色双龙会",  "一色四同顺",
    "一色四节高",  "一色四步高",  "一色四连环",   "三杠",        "混幺九",
    "七对",        "七星不靠",    "全双刻",       "清一色",      "一色三同顺",
    "一色三节高",  "全大",        "全中",         "全小",        "清龙",
    "三色双龙会",  "一色三步高",  "一色三连环",   "全带五",      "三同刻",
    "三暗刻",      "全不靠",      "组合龙",       "大于五",      "小于五",
    "三风刻",      "花龙",        "推不倒",       "三色三同顺",  "三色三节高",
    "无番和",      "妙手回春",    "海底捞月",     "杠上开花",    "抢杠和",
    "碰碰和",      "混一色",      "三色三步高",   "五门齐",      "全求人",
    "双暗杠",      "双箭刻",      "全带幺",       "不求人",      "双明杠",
    "和绝张",      "箭刻",        "圈风刻",       "门风刻",      "门前清",
    "平和",        "四归一",      "双同刻",       "双暗刻",      "暗杠",
    "断幺",        "一般高",      "喜相逢",       "连六",        "老少副",
    "幺九刻",      "明杠",        "缺一门",       "无字",        "独听・边张",
    "独听・嵌张",  "独听・单钓",  "自摸",         "花牌",        "明暗杠",
    "\u203b 天和", "\u203b 地和", "\u203b 人和Ⅰ", "\u203b 人和Ⅱ"

};

} // namespace base
} // namespace tziakcha

#endif
